app/controllers/admin/users_controller.rb

  def index
    users = if params[:q].present? && ['login', 'email', 'full_name', 'position'].include?(params[:search_by])
      User.with_matched_field(params[:search_by], params[:q])
    else
      User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    @user.roles = user_params[:role] || []

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "full_name", "login", "role", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user.roles = user_params[:role] || []
    if @user.update(user_params.except(:role))
---
UPDATE "users" SET "full_name" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["full_name", ""], ["updated_at", Fri, 07 Feb 2014 16:02:37 UTC +00:00]]